УТ/src/Catalogs/АУ_СервиснаяБазаДанных/АУ_СервиснаяБазаДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>АУ_СервиснаяБазаДанных</name>
  <attributes>
    <name>Прибор</name>
    <type>
      <types>CatalogRef.АУ_Приборы</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Производители</types>
    </type>
  </attributes>
  <attributes>
    <name>СерийныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>CatalogRef.АУ_Направления</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеЛПУ</name>
    <type>
      <types>CatalogRef.АУ_НаименованияЛПУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеЛПУ</name>
    <type>
      <types>CatalogRef.АУ_ПодразделенияЛПУ</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресУстановки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СложностьУстановки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВозможностьОбслуживания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерГарантийногоТалона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаМонтажа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОбслуживания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.АУ_Статусы</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

УТ/src/Catalogs/АУ_СервиснаяБазаДанных/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Массив=Новый Массив;
	Массив.Добавить(СокрЛП(Прибор));
	Если ЗначениеЗаполнено(СерийныйНомер) Тогда
		Массив.Добавить(СокрЛП(СерийныйНомер));
	КонецЕсли;
	Если ЗначениеЗаполнено(НаименованиеЛПУ) Тогда
		Массив.Добавить(СокрЛП(НаименованиеЛПУ));
	КонецЕсли;
	Если ЗначениеЗаполнено(ПодразделениеЛПУ) Тогда
		Массив.Добавить(СокрЛП(ПодразделениеЛПУ));
	КонецЕсли;
	Если ЗначениеЗаполнено(АдресУстановки) Тогда
		Массив.Добавить(СокрЛП(АдресУстановки));
	КонецЕсли;
	Если ЗначениеЗаполнено(ДатаМонтажа) Тогда
		Массив.Добавить(СокрЛП(ДатаМонтажа));
	КонецЕсли;
	
	Наименование=СтрСоединить(Массив,", ");
	
КонецПроцедуры
